//;******************************************************************************
//;* Copyright (c) 1983-2011, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
// *++
//
// Copyright (c) 2004, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   DeviceManagerStrings.vfr
//
// Abstract:
//
//   String definitions for the Device Manager.
//
// Revision History:
//
// --*/

/=#

#langdef eng "English"
#langdef fra "Français"
#langdef zho "\wide中文\narrow"
#langdef jpn "\wide日本語\narrow"
#langdef ita "Italian"
#langdef spa "Spanish"
#langdef ger "German"
#langdef por "Portuguese"

#string STR_DEVICE_MANAGER_TITLE       #language eng  "Device Manager"
                                       #language fra  "Device Manager"
#string STR_DEVICES_LIST               #language eng  "Devices List"
                                       #language fra  "Devices List"
#string STR_DISK_DEVICE                #language eng  "Disk Devices"
                                       #language fra  "Disk Devices"
#string STR_VIDEO_DEVICE               #language eng  "Video Devices"
                                       #language fra  "Video Devices"
#string STR_NETWORK_DEVICE             #language eng  "Network Devices"
                                       #language fra  "Network Devices"
#string STR_INPUT_DEVICE               #language eng  "Input Devices"
                                       #language fra  "Input Devices"
#string STR_ON_BOARD_DEVICE            #language eng  "Motherboard Devices"
                                       #language fra  "Motherboard Devices"
#string STR_OTHER_DEVICE               #language eng  "Other Devices"
                                       #language fra  "Other Devices"
#string STR_EMPTY_STRING               #language eng  ""
                                       #language fra  ""
#string STR_DRIVER_HEALTH_STATUS_HELP  #language eng  "Check whether all the controllers in the platform are healthy"
                                       #language fra  "Check whether all the controllers in the platform are healthy"
#string STR_DRIVER_HEALTH_ALL_HEALTHY  #language eng  "  The platform is healthy"
                                       #language fra  "  The platform is healthy"
#string STR_DRIVER_NOT_HEALTH          #language eng  "  Some drivers are not healthy"
                                       #language fra  "  Some drivers are not healthy"
#string STR_DH_BANNER                  #language eng  "Driver Health"
                                       #language fra  "Driver Health"
#string STR_DM_DRIVER_HEALTH_TITLE     #language eng  "Driver Health"
                                       #language fra  "Driver Health"
#string STR_DH_STATUS_LIST             #language eng  "All Driver Health Status List"
                                       #language fra  "All Driver Health Status List"
#string STR_DRIVER_HEALTH_REPAIR_ALL   #language eng  "Repair All"
                                       #language fra  "Repair All"                                       
#string STR_DH_REPAIR_ALL_TITLE        #language eng  "Repair the whole platform"
                                       #language fra  "Repair the whole platform"
#string STR_DH_REPAIR_ALL_HELP         #language eng  "Repair the whole platform until all modules reach terminal status"
                                       #language fra  "Repair the whole platform until all modules reach terminal status"
#string STR_DH_REPAIR_SINGLE_TITLE     #language eng  "Item can not get name"
                                       #language fra  "Item can not get name"  
#string STR_DH_REPAIR_SINGLE_HELP      #language eng  "Repair single driver with specify controller"
                                       #language fra  "Repair single driver with specify controller"
#string STR_EXIT_STRING                #language eng  "Press ESC to exit."
                                       #language fra  "Press ESC to exit."
#string STR_ONE_OF_VBIOS               #language eng  "Primary Video BIOS"
#string STR_ONE_OF_VBIOS_HELP          #language eng  "Set primary video BIOS"
#string STR_ONE_OF_PCI                 #language eng  "PCI"
#string STR_ONE_OF_AGP                 #language eng  "AGP"
//
// Ensure that this is the last string.  We are using it programmatically
// to do string token re-usage settings for the Device Manager since we are
// constantly recreating this page based on HII population.
//
#string STR_EMPTY_STRING	       #language eng  ""

#string STR_REPAIR_REQUIRED            #language eng  "  Repair Required."
                                       #language fra  "  Repair Required."
#string STR_CONFIGURATION_REQUIRED     #language eng  "  Configuration Required."
                                       #language fra  "  Configuration Required."
#string STR_OPERATION_FAILED           #language eng  "  Operation Failed."
                                       #language fra  "  Operation Failed."
#string STR_RECONNECT_REQUIRED         #language eng  "  Reconnect Required."
                                       #language fra  "  Reconnect Required."
#string STR_REBOOT_REQUIRED            #language eng  "  Reboot Required."
                                       #language fra  "  Reboot Required."
#string STR_NO_OPERATION_REQUIRED      #language eng  "  No Operation Required."
                                       #language fra  "  No Operation Required."
#string STR_DRIVER_HEALTH_HEALTHY      #language eng  "  Healthy."
                                       #language fra  "  Healthy."
#string STR_FORM_NETWORK_DEVICE_TITLE  #language eng  "Network Device"
                                       #language fra  "Network Device"
#string STR_FORM_NETWORK_DEVICE_HELP   #language eng  "Network Device Help..."
                                       #language fra  "Network Device Help..."
#string STR_NETWORK_DEVICE_STRING      #language eng  "Network Device"
                                       #language fra  "Network Device"
#string STR_FORM_NETWORK_DEVICE_LIST_HELP   #language eng  "Select the network device according the MAC address"
                                            #language fra  "Select the network device according the MAC address"
#string STR_FORM_NETWORK_DEVICE_LIST_TITLE  #language eng  "Network Device List"
                                            #language fra  "Network Device List"
#string STR_NETWORK_DEVICE_LIST_STRING      #language eng  "Network Device List"
                                            #language fra  "Network Device List"
#string STR_NETWORK_DEVICE_HELP             #language eng  "Network Device"
                                            #language fra  "Network Device"
//
// Ensure that this is the last string.  We are using it programmatically
// to do string token re-usage settings for the Device Manager since we are
// constantly recreating this page based on HII population.
////
